package lesson03.homework;

public class Main {
    public static void main(String[] args) {

        byte num = 10;
        System.out.println("Значение переменной типа byte: " + num);
        System.out.println("Byte наименьший по размеру целочисленный тип.\n" +
                "Это 8-битовый тип с диапазоном допустимых значений от -128 до 127.\n" +
                "Переменные типа byte часто используются при работе с потоком данных из сети или файла, \n" +
                "а также при работе с необработанными двоичными данными или в массивах для экономии памяти.");




    }
}
